graph main_graph (
  %gen_input_image[FLOAT, batch_sizex256x256x3]
) initializers (
  %intro.weight[FLOAT, 60x3x3x3]
  %intro.bias[FLOAT, 60]
  %ending.weight[FLOAT, 3x60x3x3]
  %ending.bias[FLOAT, 3]
  %encoders.0.0.beta[FLOAT, 1x60x1x1]
  %encoders.0.0.gamma[FLOAT, 1x60x1x1]
  %encoders.0.0.conv1.weight[FLOAT, 120x60x1x1]
  %encoders.0.0.conv1.bias[FLOAT, 120]
  %encoders.0.0.conv2.weight[FLOAT, 120x1x3x3]
  %encoders.0.0.conv2.bias[FLOAT, 120]
  %encoders.0.0.GCE.depthwise_separable_convs.0.pointwise.weight[FLOAT, 60x60x1x1]
  %encoders.0.0.GCE.depthwise_separable_convs.0.depthwise.weight[FLOAT, 60x1x3x3]
  %encoders.0.0.GCE.depthwise_separable_convs.1.pointwise.weight[FLOAT, 60x60x1x1]
  %encoders.0.0.GCE.depthwise_separable_convs.1.depthwise.weight[FLOAT, 60x1x3x3]
  %encoders.0.0.GCE.depthwise_separable_convs.2.pointwise.weight[FLOAT, 60x60x1x1]
  %encoders.0.0.GCE.depthwise_separable_convs.2.depthwise.weight[FLOAT, 60x1x5x5]
  %encoders.0.0.project_out.weight[FLOAT, 60x300x1x1]
  %encoders.0.0.project_out.bias[FLOAT, 60]
  %encoders.0.0.sca.1.weight[FLOAT, 300x300x1x1]
  %encoders.0.0.sca.1.bias[FLOAT, 300]
  %encoders.0.0.conv4.weight[FLOAT, 120x60x1x1]
  %encoders.0.0.conv4.bias[FLOAT, 120]
  %encoders.0.0.conv5.weight[FLOAT, 60x60x1x1]
  %encoders.0.0.conv5.bias[FLOAT, 60]
  %encoders.0.0.norm1.weight[FLOAT, 60]
  %encoders.0.0.norm1.bias[FLOAT, 60]
  %encoders.0.0.norm2.weight[FLOAT, 60]
  %encoders.0.0.norm2.bias[FLOAT, 60]
  %encoders.0.1.beta[FLOAT, 1x60x1x1]
  %encoders.0.1.gamma[FLOAT, 1x60x1x1]
  %encoders.0.1.conv1.weight[FLOAT, 120x60x1x1]
  %encoders.0.1.conv1.bias[FLOAT, 120]
  %encoders.0.1.conv2.weight[FLOAT, 120x1x3x3]
  %encoders.0.1.conv2.bias[FLOAT, 120]
  %encoders.0.1.GCE.depthwise_separable_convs.0.pointwise.weight[FLOAT, 60x60x1x1]
  %encoders.0.1.GCE.depthwise_separable_convs.0.depthwise.weight[FLOAT, 60x1x3x3]
  %encoders.0.1.GCE.depthwise_separable_convs.1.pointwise.weight[FLOAT, 60x60x1x1]
  %encoders.0.1.GCE.depthwise_separable_convs.1.depthwise.weight[FLOAT, 60x1x3x3]
  %encoders.0.1.GCE.depthwise_separable_convs.2.pointwise.weight[FLOAT, 60x60x1x1]
  %encoders.0.1.GCE.depthwise_separable_convs.2.depthwise.weight[FLOAT, 60x1x5x5]
  %encoders.0.1.project_out.weight[FLOAT, 60x300x1x1]
  %encoders.0.1.project_out.bias[FLOAT, 60]
  %encoders.0.1.sca.1.weight[FLOAT, 300x300x1x1]
  %encoders.0.1.sca.1.bias[FLOAT, 300]
  %encoders.0.1.conv4.weight[FLOAT, 120x60x1x1]
  %encoders.0.1.conv4.bias[FLOAT, 120]
  %encoders.0.1.conv5.weight[FLOAT, 60x60x1x1]
  %encoders.0.1.conv5.bias[FLOAT, 60]
  %encoders.0.1.norm1.weight[FLOAT, 60]
  %encoders.0.1.norm1.bias[FLOAT, 60]
  %encoders.0.1.norm2.weight[FLOAT, 60]
  %encoders.0.1.norm2.bias[FLOAT, 60]
  %encoders.1.0.beta[FLOAT, 1x120x1x1]
  %encoders.1.0.gamma[FLOAT, 1x120x1x1]
  %encoders.1.0.conv1.weight[FLOAT, 240x120x1x1]
  %encoders.1.0.conv1.bias[FLOAT, 240]
  %encoders.1.0.conv2.weight[FLOAT, 240x1x3x3]
  %encoders.1.0.conv2.bias[FLOAT, 240]
  %encoders.1.0.GCE.depthwise_separable_convs.0.pointwise.weight[FLOAT, 120x120x1x1]
  %encoders.1.0.GCE.depthwise_separable_convs.0.depthwise.weight[FLOAT, 120x1x3x3]
  %encoders.1.0.GCE.depthwise_separable_convs.1.pointwise.weight[FLOAT, 120x120x1x1]
  %encoders.1.0.GCE.depthwise_separable_convs.1.depthwise.weight[FLOAT, 120x1x3x3]
  %encoders.1.0.GCE.depthwise_separable_convs.2.pointwise.weight[FLOAT, 120x120x1x1]
  %encoders.1.0.GCE.depthwise_separable_convs.2.depthwise.weight[FLOAT, 120x1x5x5]
  %encoders.1.0.project_out.weight[FLOAT, 120x600x1x1]
  %encoders.1.0.project_out.bias[FLOAT, 120]
  %encoders.1.0.sca.1.weight[FLOAT, 600x600x1x1]
  %encoders.1.0.sca.1.bias[FLOAT, 600]
  %encoders.1.0.conv4.weight[FLOAT, 240x120x1x1]
  %encoders.1.0.conv4.bias[FLOAT, 240]
  %encoders.1.0.conv5.weight[FLOAT, 120x120x1x1]
  %encoders.1.0.conv5.bias[FLOAT, 120]
  %encoders.1.0.norm1.weight[FLOAT, 120]
  %encoders.1.0.norm1.bias[FLOAT, 120]
  %encoders.1.0.norm2.weight[FLOAT, 120]
  %encoders.1.0.norm2.bias[FLOAT, 120]
  %encoders.1.1.beta[FLOAT, 1x120x1x1]
  %encoders.1.1.gamma[FLOAT, 1x120x1x1]
  %encoders.1.1.conv1.weight[FLOAT, 240x120x1x1]
  %encoders.1.1.conv1.bias[FLOAT, 240]
  %encoders.1.1.conv2.weight[FLOAT, 240x1x3x3]
  %encoders.1.1.conv2.bias[FLOAT, 240]
  %encoders.1.1.GCE.depthwise_separable_convs.0.pointwise.weight[FLOAT, 120x120x1x1]
  %encoders.1.1.GCE.depthwise_separable_convs.0.depthwise.weight[FLOAT, 120x1x3x3]
  %encoders.1.1.GCE.depthwise_separable_convs.1.pointwise.weight[FLOAT, 120x120x1x1]
  %encoders.1.1.GCE.depthwise_separable_convs.1.depthwise.weight[FLOAT, 120x1x3x3]
  %encoders.1.1.GCE.depthwise_separable_convs.2.pointwise.weight[FLOAT, 120x120x1x1]
  %encoders.1.1.GCE.depthwise_separable_convs.2.depthwise.weight[FLOAT, 120x1x5x5]
  %encoders.1.1.project_out.weight[FLOAT, 120x600x1x1]
  %encoders.1.1.project_out.bias[FLOAT, 120]
  %encoders.1.1.sca.1.weight[FLOAT, 600x600x1x1]
  %encoders.1.1.sca.1.bias[FLOAT, 600]
  %encoders.1.1.conv4.weight[FLOAT, 240x120x1x1]
  %encoders.1.1.conv4.bias[FLOAT, 240]
  %encoders.1.1.conv5.weight[FLOAT, 120x120x1x1]
  %encoders.1.1.conv5.bias[FLOAT, 120]
  %encoders.1.1.norm1.weight[FLOAT, 120]
  %encoders.1.1.norm1.bias[FLOAT, 120]
  %encoders.1.1.norm2.weight[FLOAT, 120]
  %encoders.1.1.norm2.bias[FLOAT, 120]
  %encoders.2.0.beta[FLOAT, 1x240x1x1]
  %encoders.2.0.gamma[FLOAT, 1x240x1x1]
  %encoders.2.0.conv1.weight[FLOAT, 480x240x1x1]
  %encoders.2.0.conv1.bias[FLOAT, 480]
  %encoders.2.0.conv2.weight[FLOAT, 480x1x3x3]
  %encoders.2.0.conv2.bias[FLOAT, 480]
  %encoders.2.0.GCE.depthwise_separable_convs.0.pointwise.weight[FLOAT, 240x240x1x1]
  %encoders.2.0.GCE.depthwise_separable_convs.0.depthwise.weight[FLOAT, 240x1x3x3]
  %encoders.2.0.GCE.depthwise_separable_convs.1.pointwise.weight[FLOAT, 240x240x1x1]
  %encoders.2.0.GCE.depthwise_separable_convs.1.depthwise.weight[FLOAT, 240x1x3x3]
  %encoders.2.0.project_out.weight[FLOAT, 240x960x1x1]
  %encoders.2.0.project_out.bias[FLOAT, 240]
  %encoders.2.0.sca.1.weight[FLOAT, 960x960x1x1]
  %encoders.2.0.sca.1.bias[FLOAT, 960]
  %encoders.2.0.conv4.weight[FLOAT, 480x240x1x1]
  %encoders.2.0.conv4.bias[FLOAT, 480]
  %encoders.2.0.conv5.weight[FLOAT, 240x240x1x1]
  %encoders.2.0.conv5.bias[FLOAT, 240]
  %encoders.2.0.norm1.weight[FLOAT, 240]
  %encoders.2.0.norm1.bias[FLOAT, 240]
  %encoders.2.0.norm2.weight[FLOAT, 240]
  %encoders.2.0.norm2.bias[FLOAT, 240]
  %encoders.2.1.beta[FLOAT, 1x240x1x1]
  %encoders.2.1.gamma[FLOAT, 1x240x1x1]
  %encoders.2.1.conv1.weight[FLOAT, 480x240x1x1]
  %encoders.2.1.conv1.bias[FLOAT, 480]
  %encoders.2.1.conv2.weight[FLOAT, 480x1x3x3]
  %encoders.2.1.conv2.bias[FLOAT, 480]
  %encoders.2.1.GCE.depthwise_separable_convs.0.pointwise.weight[FLOAT, 240x240x1x1]
  %encoders.2.1.GCE.depthwise_separable_convs.0.depthwise.weight[FLOAT, 240x1x3x3]
  %encoders.2.1.GCE.depthwise_separable_convs.1.pointwise.weight[FLOAT, 240x240x1x1]
  %encoders.2.1.GCE.depthwise_separable_convs.1.depthwise.weight[FLOAT, 240x1x3x3]
  %encoders.2.1.project_out.weight[FLOAT, 240x960x1x1]
  %encoders.2.1.project_out.bias[FLOAT, 240]
  %encoders.2.1.sca.1.weight[FLOAT, 960x960x1x1]
  %encoders.2.1.sca.1.bias[FLOAT, 960]
  %encoders.2.1.conv4.weight[FLOAT, 480x240x1x1]
  %encoders.2.1.conv4.bias[FLOAT, 480]
  %encoders.2.1.conv5.weight[FLOAT, 240x240x1x1]
  %encoders.2.1.conv5.bias[FLOAT, 240]
  %encoders.2.1.norm1.weight[FLOAT, 240]
  %encoders.2.1.norm1.bias[FLOAT, 240]
  %encoders.2.1.norm2.weight[FLOAT, 240]
  %encoders.2.1.norm2.bias[FLOAT, 240]
  %encoders.2.2.beta[FLOAT, 1x240x1x1]
  %encoders.2.2.gamma[FLOAT, 1x240x1x1]
  %encoders.2.2.conv1.weight[FLOAT, 480x240x1x1]
  %encoders.2.2.conv1.bias[FLOAT, 480]
  %encoders.2.2.conv2.weight[FLOAT, 480x1x3x3]
  %encoders.2.2.conv2.bias[FLOAT, 480]
  %encoders.2.2.GCE.depthwise_separable_convs.0.pointwise.weight[FLOAT, 240x240x1x1]
  %encoders.2.2.GCE.depthwise_separable_convs.0.depthwise.weight[FLOAT, 240x1x3x3]
  %encoders.2.2.GCE.depthwise_separable_convs.1.pointwise.weight[FLOAT, 240x240x1x1]
  %encoders.2.2.GCE.depthwise_separable_convs.1.depthwise.weight[FLOAT, 240x1x3x3]
  %encoders.2.2.project_out.weight[FLOAT, 240x960x1x1]
  %encoders.2.2.project_out.bias[FLOAT, 240]
  %encoders.2.2.sca.1.weight[FLOAT, 960x960x1x1]
  %encoders.2.2.sca.1.bias[FLOAT, 960]
  %encoders.2.2.conv4.weight[FLOAT, 480x240x1x1]
  %encoders.2.2.conv4.bias[FLOAT, 480]
  %encoders.2.2.conv5.weight[FLOAT, 240x240x1x1]
  %encoders.2.2.conv5.bias[FLOAT, 240]
  %encoders.2.2.norm1.weight[FLOAT, 240]
  %encoders.2.2.norm1.bias[FLOAT, 240]
  %encoders.2.2.norm2.weight[FLOAT, 240]
  %encoders.2.2.norm2.bias[FLOAT, 240]
  %encoders.2.3.beta[FLOAT, 1x240x1x1]
  %encoders.2.3.gamma[FLOAT, 1x240x1x1]
  %encoders.2.3.conv1.weight[FLOAT, 480x240x1x1]
  %encoders.2.3.conv1.bias[FLOAT, 480]
  %encoders.2.3.conv2.weight[FLOAT, 480x1x3x3]
  %encoders.2.3.conv2.bias[FLOAT, 480]
  %encoders.2.3.GCE.depthwise_separable_convs.0.pointwise.weight[FLOAT, 240x240x1x1]
  %encoders.2.3.GCE.depthwise_separable_convs.0.depthwise.weight[FLOAT, 240x1x3x3]
  %encoders.2.3.GCE.depthwise_separable_convs.1.pointwise.weight[FLOAT, 240x240x1x1]
  %encoders.2.3.GCE.depthwise_separable_convs.1.depthwise.weight[FLOAT, 240x1x3x3]
  %encoders.2.3.project_out.weight[FLOAT, 240x960x1x1]
  %encoders.2.3.project_out.bias[FLOAT, 240]
  %encoders.2.3.sca.1.weight[FLOAT, 960x960x1x1]
  %encoders.2.3.sca.1.bias[FLOAT, 960]
  %encoders.2.3.conv4.weight[FLOAT, 480x240x1x1]
  %encoders.2.3.conv4.bias[FLOAT, 480]
  %encoders.2.3.conv5.weight[FLOAT, 240x240x1x1]
  %encoders.2.3.conv5.bias[FLOAT, 240]
  %encoders.2.3.norm1.weight[FLOAT, 240]
  %encoders.2.3.norm1.bias[FLOAT, 240]
  %encoders.2.3.norm2.weight[FLOAT, 240]
  %encoders.2.3.norm2.bias[FLOAT, 240]
  %encoders.3.0.beta[FLOAT, 1x480x1x1]
  %encoders.3.0.gamma[FLOAT, 1x480x1x1]
  %encoders.3.0.conv1.weight[FLOAT, 960x480x1x1]
  %encoders.3.0.conv1.bias[FLOAT, 960]
  %encoders.3.0.conv2.weight[FLOAT, 960x1x3x3]
  %encoders.3.0.conv2.bias[FLOAT, 960]
  %encoders.3.0.GCE.depthwise_separable_convs.0.pointwise.weight[FLOAT, 480x480x1x1]
  %encoders.3.0.GCE.depthwise_separable_convs.0.depthwise.weight[FLOAT, 480x1x3x3]
  %encoders.3.0.GCE.depthwise_separable_convs.1.pointwise.weight[FLOAT, 480x480x1x1]
  %encoders.3.0.GCE.depthwise_separable_convs.1.depthwise.weight[FLOAT, 480x1x3x3]
  %encoders.3.0.project_out.weight[FLOAT, 480x1920x1x1]
  %encoders.3.0.project_out.bias[FLOAT, 480]
  %encoders.3.0.sca.1.weight[FLOAT, 1920x1920x1x1]
  %encoders.3.0.sca.1.bias[FLOAT, 1920]
  %encoders.3.0.conv4.weight[FLOAT, 960x480x1x1]
  %encoders.3.0.conv4.bias[FLOAT, 960]
  %encoders.3.0.conv5.weight[FLOAT, 480x480x1x1]
  %encoders.3.0.conv5.bias[FLOAT, 480]
  %encoders.3.0.norm1.weight[FLOAT, 480]
  %encoders.3.0.norm1.bias[FLOAT, 480]
  %encoders.3.0.norm2.weight[FLOAT, 480]
  %encoders.3.0.norm2.bias[FLOAT, 480]
  %encoders.3.1.beta[FLOAT, 1x480x1x1]
  %encoders.3.1.gamma[FLOAT, 1x480x1x1]
  %encoders.3.1.conv1.weight[FLOAT, 960x480x1x1]
  %encoders.3.1.conv1.bias[FLOAT, 960]
  %encoders.3.1.conv2.weight[FLOAT, 960x1x3x3]
  %encoders.3.1.conv2.bias[FLOAT, 960]
  %encoders.3.1.GCE.depthwise_separable_convs.0.pointwise.weight[FLOAT, 480x480x1x1]
  %encoders.3.1.GCE.depthwise_separable_convs.0.depthwise.weight[FLOAT, 480x1x3x3]
  %encoders.3.1.GCE.depthwise_separable_convs.1.pointwise.weight[FLOAT, 480x480x1x1]
  %encoders.3.1.GCE.depthwise_separable_convs.1.depthwise.weight[FLOAT, 480x1x3x3]
  %encoders.3.1.project_out.weight[FLOAT, 480x1920x1x1]
  %encoders.3.1.project_out.bias[FLOAT, 480]
  %encoders.3.1.sca.1.weight[FLOAT, 1920x1920x1x1]
  %encoders.3.1.sca.1.bias[FLOAT, 1920]
  %encoders.3.1.conv4.weight[FLOAT, 960x480x1x1]
  %encoders.3.1.conv4.bias[FLOAT, 960]
  %encoders.3.1.conv5.weight[FLOAT, 480x480x1x1]
  %encoders.3.1.conv5.bias[FLOAT, 480]
  %encoders.3.1.norm1.weight[FLOAT, 480]
  %encoders.3.1.norm1.bias[FLOAT, 480]
  %encoders.3.1.norm2.weight[FLOAT, 480]
  %encoders.3.1.norm2.bias[FLOAT, 480]
  %encoders.3.2.beta[FLOAT, 1x480x1x1]
  %encoders.3.2.gamma[FLOAT, 1x480x1x1]
  %encoders.3.2.conv1.weight[FLOAT, 960x480x1x1]
  %encoders.3.2.conv1.bias[FLOAT, 960]
  %encoders.3.2.conv2.weight[FLOAT, 960x1x3x3]
  %encoders.3.2.conv2.bias[FLOAT, 960]
  %encoders.3.2.GCE.depthwise_separable_convs.0.pointwise.weight[FLOAT, 480x480x1x1]
  %encoders.3.2.GCE.depthwise_separable_convs.0.depthwise.weight[FLOAT, 480x1x3x3]
  %encoders.3.2.GCE.depthwise_separable_convs.1.pointwise.weight[FLOAT, 480x480x1x1]
  %encoders.3.2.GCE.depthwise_separable_convs.1.depthwise.weight[FLOAT, 480x1x3x3]
  %encoders.3.2.project_out.weight[FLOAT, 480x1920x1x1]
  %encoders.3.2.project_out.bias[FLOAT, 480]
  %encoders.3.2.sca.1.weight[FLOAT, 1920x1920x1x1]
  %encoders.3.2.sca.1.bias[FLOAT, 1920]
  %encoders.3.2.conv4.weight[FLOAT, 960x480x1x1]
  %encoders.3.2.conv4.bias[FLOAT, 960]
  %encoders.3.2.conv5.weight[FLOAT, 480x480x1x1]
  %encoders.3.2.conv5.bias[FLOAT, 480]
  %encoders.3.2.norm1.weight[FLOAT, 480]
  %encoders.3.2.norm1.bias[FLOAT, 480]
  %encoders.3.2.norm2.weight[FLOAT, 480]
  %encoders.3.2.norm2.bias[FLOAT, 480]
  %encoders.3.3.beta[FLOAT, 1x480x1x1]
  %encoders.3.3.gamma[FLOAT, 1x480x1x1]
  %encoders.3.3.conv1.weight[FLOAT, 960x480x1x1]
  %encoders.3.3.conv1.bias[FLOAT, 960]
  %encoders.3.3.conv2.weight[FLOAT, 960x1x3x3]
  %encoders.3.3.conv2.bias[FLOAT, 960]
  %encoders.3.3.GCE.depthwise_separable_convs.0.pointwise.weight[FLOAT, 480x480x1x1]
  %encoders.3.3.GCE.depthwise_separable_convs.0.depthwise.weight[FLOAT, 480x1x3x3]
  %encoders.3.3.GCE.depthwise_separable_convs.1.pointwise.weight[FLOAT, 480x480x1x1]
  %encoders.3.3.GCE.depthwise_separable_convs.1.depthwise.weight[FLOAT, 480x1x3x3]
  %encoders.3.3.project_out.weight[FLOAT, 480x1920x1x1]
  %encoders.3.3.project_out.bias[FLOAT, 480]
  %encoders.3.3.sca.1.weight[FLOAT, 1920x1920x1x1]
  %encoders.3.3.sca.1.bias[FLOAT, 1920]
  %encoders.3.3.conv4.weight[FLOAT, 960x480x1x1]
  %encoders.3.3.conv4.bias[FLOAT, 960]
  %encoders.3.3.conv5.weight[FLOAT, 480x480x1x1]
  %encoders.3.3.conv5.bias[FLOAT, 480]
  %encoders.3.3.norm1.weight[FLOAT, 480]
  %encoders.3.3.norm1.bias[FLOAT, 480]
  %encoders.3.3.norm2.weight[FLOAT, 480]
  %encoders.3.3.norm2.bias[FLOAT, 480]
  %encoders.3.4.beta[FLOAT, 1x480x1x1]
  %encoders.3.4.gamma[FLOAT, 1x480x1x1]
  %encoders.3.4.conv1.weight[FLOAT, 960x480x1x1]
  %encoders.3.4.conv1.bias[FLOAT, 960]
  %encoders.3.4.conv2.weight[FLOAT, 960x1x3x3]
  %encoders.3.4.conv2.bias[FLOAT, 960]
  %encoders.3.4.GCE.depthwise_separable_convs.0.pointwise.weight[FLOAT, 480x480x1x1]
  %encoders.3.4.GCE.depthwise_separable_convs.0.depthwise.weight[FLOAT, 480x1x3x3]
  %encoders.3.4.GCE.depthwise_separable_convs.1.pointwise.weight[FLOAT, 480x480x1x1]
  %encoders.3.4.GCE.depthwise_separable_convs.1.depthwise.weight[FLOAT, 480x1x3x3]
  %encoders.3.4.project_out.weight[FLOAT, 480x1920x1x1]
  %encoders.3.4.project_out.bias[FLOAT, 480]
  %encoders.3.4.sca.1.weight[FLOAT, 1920x1920x1x1]
  %encoders.3.4.sca.1.bias[FLOAT, 1920]
  %encoders.3.4.conv4.weight[FLOAT, 960x480x1x1]
  %encoders.3.4.conv4.bias[FLOAT, 960]
  %encoders.3.4.conv5.weight[FLOAT, 480x480x1x1]
  %encoders.3.4.conv5.bias[FLOAT, 480]
  %encoders.3.4.norm1.weight[FLOAT, 480]
  %encoders.3.4.norm1.bias[FLOAT, 480]
  %encoders.3.4.norm2.weight[FLOAT, 480]
  %encoders.3.4.norm2.bias[FLOAT, 480]
  %encoders.3.5.beta[FLOAT, 1x480x1x1]
  %encoders.3.5.gamma[FLOAT, 1x480x1x1]
  %encoders.3.5.conv1.weight[FLOAT, 960x480x1x1]
  %encoders.3.5.conv1.bias[FLOAT, 960]
  %encoders.3.5.conv2.weight[FLOAT, 960x1x3x3]
  %encoders.3.5.conv2.bias[FLOAT, 960]
  %encoders.3.5.GCE.depthwise_separable_convs.0.pointwise.weight[FLOAT, 480x480x1x1]
  %encoders.3.5.GCE.depthwise_separable_convs.0.depthwise.weight[FLOAT, 480x1x3x3]
  %encoders.3.5.GCE.depthwise_separable_convs.1.pointwise.weight[FLOAT, 480x480x1x1]
  %encoders.3.5.GCE.depthwise_separable_convs.1.depthwise.weight[FLOAT, 480x1x3x3]
  %encoders.3.5.project_out.weight[FLOAT, 480x1920x1x1]
  %encoders.3.5.project_out.bias[FLOAT, 480]
  %encoders.3.5.sca.1.weight[FLOAT, 1920x1920x1x1]
  %encoders.3.5.sca.1.bias[FLOAT, 1920]
  %encoders.3.5.conv4.weight[FLOAT, 960x480x1x1]
  %encoders.3.5.conv4.bias[FLOAT, 960]
  %encoders.3.5.conv5.weight[FLOAT, 480x480x1x1]
  %encoders.3.5.conv5.bias[FLOAT, 480]
  %encoders.3.5.norm1.weight[FLOAT, 480]
  %encoders.3.5.norm1.bias[FLOAT, 480]
  %encoders.3.5.norm2.weight[FLOAT, 480]
  %encoders.3.5.norm2.bias[FLOAT, 480]
  %decoders.0.0.beta[FLOAT, 1x480x1x1]
  %decoders.0.0.gamma[FLOAT, 1x480x1x1]
  %decoders.0.0.conv1.weight[FLOAT, 960x480x1x1]
  %decoders.0.0.conv1.bias[FLOAT, 960]
  %decoders.0.0.conv2.weight[FLOAT, 960x1x3x3]
  %decoders.0.0.conv2.bias[FLOAT, 960]
  %decoders.0.0.conv3.weight[FLOAT, 480x480x1x1]
  %decoders.0.0.conv3.bias[FLOAT, 480]
  %decoders.0.0.sca.1.weight[FLOAT, 480x480x1x1]
  %decoders.0.0.sca.1.bias[FLOAT, 480]
  %decoders.0.0.conv4.weight[FLOAT, 960x480x1x1]
  %decoders.0.0.conv4.bias[FLOAT, 960]
  %decoders.0.0.conv5.weight[FLOAT, 480x480x1x1]
  %decoders.0.0.conv5.bias[FLOAT, 480]
  %decoders.0.0.norm1.weight[FLOAT, 480]
  %decoders.0.0.norm1.bias[FLOAT, 480]
  %decoders.0.0.norm2.weight[FLOAT, 480]
  %decoders.0.0.norm2.bias[FLOAT, 480]
  %decoders.0.1.beta[FLOAT, 1x480x1x1]
  %decoders.0.1.gamma[FLOAT, 1x480x1x1]
  %decoders.0.1.conv1.weight[FLOAT, 960x480x1x1]
  %decoders.0.1.conv1.bias[FLOAT, 960]
  %decoders.0.1.conv2.weight[FLOAT, 960x1x3x3]
  %decoders.0.1.conv2.bias[FLOAT, 960]
  %decoders.0.1.conv3.weight[FLOAT, 480x480x1x1]
  %decoders.0.1.conv3.bias[FLOAT, 480]
  %decoders.0.1.sca.1.weight[FLOAT, 480x480x1x1]
  %decoders.0.1.sca.1.bias[FLOAT, 480]
  %decoders.0.1.conv4.weight[FLOAT, 960x480x1x1]
  %decoders.0.1.conv4.bias[FLOAT, 960]
  %decoders.0.1.conv5.weight[FLOAT, 480x480x1x1]
  %decoders.0.1.conv5.bias[FLOAT, 480]
  %decoders.0.1.norm1.weight[FLOAT, 480]
  %decoders.0.1.norm1.bias[FLOAT, 480]
  %decoders.0.1.norm2.weight[FLOAT, 480]
  %decoders.0.1.norm2.bias[FLOAT, 480]
  %decoders.1.0.beta[FLOAT, 1x240x1x1]
  %decoders.1.0.gamma[FLOAT, 1x240x1x1]
  %decoders.1.0.conv1.weight[FLOAT, 480x240x1x1]
  %decoders.1.0.conv1.bias[FLOAT, 480]
  %decoders.1.0.conv2.weight[FLOAT, 480x1x3x3]
  %decoders.1.0.conv2.bias[FLOAT, 480]
  %decoders.1.0.conv3.weight[FLOAT, 240x240x1x1]
  %decoders.1.0.conv3.bias[FLOAT, 240]
  %decoders.1.0.sca.1.weight[FLOAT, 240x240x1x1]
  %decoders.1.0.sca.1.bias[FLOAT, 240]
  %decoders.1.0.conv4.weight[FLOAT, 480x240x1x1]
  %decoders.1.0.conv4.bias[FLOAT, 480]
  %decoders.1.0.conv5.weight[FLOAT, 240x240x1x1]
  %decoders.1.0.conv5.bias[FLOAT, 240]
  %decoders.1.0.norm1.weight[FLOAT, 240]
  %decoders.1.0.norm1.bias[FLOAT, 240]
  %decoders.1.0.norm2.weight[FLOAT, 240]
  %decoders.1.0.norm2.bias[FLOAT, 240]
  %decoders.1.1.beta[FLOAT, 1x240x1x1]
  %decoders.1.1.gamma[FLOAT, 1x240x1x1]
  %decoders.1.1.conv1.weight[FLOAT, 480x240x1x1]
  %decoders.1.1.conv1.bias[FLOAT, 480]
  %decoders.1.1.conv2.weight[FLOAT, 480x1x3x3]
  %decoders.1.1.conv2.bias[FLOAT, 480]
  %decoders.1.1.conv3.weight[FLOAT, 240x240x1x1]
  %decoders.1.1.conv3.bias[FLOAT, 240]
  %decoders.1.1.sca.1.weight[FLOAT, 240x240x1x1]
  %decoders.1.1.sca.1.bias[FLOAT, 240]
  %decoders.1.1.conv4.weight[FLOAT, 480x240x1x1]
  %decoders.1.1.conv4.bias[FLOAT, 480]
  %decoders.1.1.conv5.weight[FLOAT, 240x240x1x1]
  %decoders.1.1.conv5.bias[FLOAT, 240]
  %decoders.1.1.norm1.weight[FLOAT, 240]
  %decoders.1.1.norm1.bias[FLOAT, 240]
  %decoders.1.1.norm2.weight[FLOAT, 240]
  %decoders.1.1.norm2.bias[FLOAT, 240]
  %decoders.2.0.beta[FLOAT, 1x120x1x1]
  %decoders.2.0.gamma[FLOAT, 1x120x1x1]
  %decoders.2.0.conv1.weight[FLOAT, 240x120x1x1]
  %decoders.2.0.conv1.bias[FLOAT, 240]
  %decoders.2.0.conv2.weight[FLOAT, 240x1x3x3]
  %decoders.2.0.conv2.bias[FLOAT, 240]
  %decoders.2.0.conv3.weight[FLOAT, 120x120x1x1]
  %decoders.2.0.conv3.bias[FLOAT, 120]
  %decoders.2.0.sca.1.weight[FLOAT, 120x120x1x1]
  %decoders.2.0.sca.1.bias[FLOAT, 120]
  %decoders.2.0.conv4.weight[FLOAT, 240x120x1x1]
  %decoders.2.0.conv4.bias[FLOAT, 240]
  %decoders.2.0.conv5.weight[FLOAT, 120x120x1x1]
  %decoders.2.0.conv5.bias[FLOAT, 120]
  %decoders.2.0.norm1.weight[FLOAT, 120]
  %decoders.2.0.norm1.bias[FLOAT, 120]
  %decoders.2.0.norm2.weight[FLOAT, 120]
  %decoders.2.0.norm2.bias[FLOAT, 120]
  %decoders.2.1.beta[FLOAT, 1x120x1x1]
  %decoders.2.1.gamma[FLOAT, 1x120x1x1]
  %decoders.2.1.conv1.weight[FLOAT, 240x120x1x1]
  %decoders.2.1.conv1.bias[FLOAT, 240]
  %decoders.2.1.conv2.weight[FLOAT, 240x1x3x3]
  %decoders.2.1.conv2.bias[FLOAT, 240]
  %decoders.2.1.conv3.weight[FLOAT, 120x120x1x1]
  %decoders.2.1.conv3.bias[FLOAT, 120]
  %decoders.2.1.sca.1.weight[FLOAT, 120x120x1x1]
  %decoders.2.1.sca.1.bias[FLOAT, 120]
  %decoders.2.1.conv4.weight[FLOAT, 240x120x1x1]
  %decoders.2.1.conv4.bias[FLOAT, 240]
  %decoders.2.1.conv5.weight[FLOAT, 120x120x1x1]
  %decoders.2.1.conv5.bias[FLOAT, 120]
  %decoders.2.1.norm1.weight[FLOAT, 120]
  %decoders.2.1.norm1.bias[FLOAT, 120]
  %decoders.2.1.norm2.weight[FLOAT, 120]
  %decoders.2.1.norm2.bias[FLOAT, 120]
  %decoders.3.0.beta[FLOAT, 1x60x1x1]
  %decoders.3.0.gamma[FLOAT, 1x60x1x1]
  %decoders.3.0.conv1.weight[FLOAT, 120x60x1x1]
  %decoders.3.0.conv1.bias[FLOAT, 120]
  %decoders.3.0.conv2.weight[FLOAT, 120x1x3x3]
  %decoders.3.0.conv2.bias[FLOAT, 120]
  %decoders.3.0.conv3.weight[FLOAT, 60x60x1x1]
  %decoders.3.0.conv3.bias[FLOAT, 60]
  %decoders.3.0.sca.1.weight[FLOAT, 60x60x1x1]
  %decoders.3.0.sca.1.bias[FLOAT, 60]
  %decoders.3.0.conv4.weight[FLOAT, 120x60x1x1]
  %decoders.3.0.conv4.bias[FLOAT, 120]
  %decoders.3.0.conv5.weight[FLOAT, 60x60x1x1]
  %decoders.3.0.conv5.bias[FLOAT, 60]
  %decoders.3.0.norm1.weight[FLOAT, 60]
  %decoders.3.0.norm1.bias[FLOAT, 60]
  %decoders.3.0.norm2.weight[FLOAT, 60]
  %decoders.3.0.norm2.bias[FLOAT, 60]
  %decoders.3.1.beta[FLOAT, 1x60x1x1]
  %decoders.3.1.gamma[FLOAT, 1x60x1x1]
  %decoders.3.1.conv1.weight[FLOAT, 120x60x1x1]
  %decoders.3.1.conv1.bias[FLOAT, 120]
  %decoders.3.1.conv2.weight[FLOAT, 120x1x3x3]
  %decoders.3.1.conv2.bias[FLOAT, 120]
  %decoders.3.1.conv3.weight[FLOAT, 60x60x1x1]
  %decoders.3.1.conv3.bias[FLOAT, 60]
  %decoders.3.1.sca.1.weight[FLOAT, 60x60x1x1]
  %decoders.3.1.sca.1.bias[FLOAT, 60]
  %decoders.3.1.conv4.weight[FLOAT, 120x60x1x1]
  %decoders.3.1.conv4.bias[FLOAT, 120]
  %decoders.3.1.conv5.weight[FLOAT, 60x60x1x1]
  %decoders.3.1.conv5.bias[FLOAT, 60]
  %decoders.3.1.norm1.weight[FLOAT, 60]
  %decoders.3.1.norm1.bias[FLOAT, 60]
  %decoders.3.1.norm2.weight[FLOAT, 60]
  %decoders.3.1.norm2.bias[FLOAT, 60]
  %middle_blks.0.beta[FLOAT, 1x960x1x1]
  %middle_blks.0.gamma[FLOAT, 1x960x1x1]
  %middle_blks.0.conv1.weight[FLOAT, 1920x960x1x1]
  %middle_blks.0.conv1.bias[FLOAT, 1920]
  %middle_blks.0.conv2.weight[FLOAT, 1920x1x3x3]
  %middle_blks.0.conv2.bias[FLOAT, 1920]
  %middle_blks.0.conv3.weight[FLOAT, 960x960x1x1]
  %middle_blks.0.conv3.bias[FLOAT, 960]
  %middle_blks.0.sca.1.weight[FLOAT, 960x960x1x1]
  %middle_blks.0.sca.1.bias[FLOAT, 960]
  %middle_blks.0.conv4.weight[FLOAT, 1920x960x1x1]
  %middle_blks.0.conv4.bias[FLOAT, 1920]
  %middle_blks.0.conv5.weight[FLOAT, 960x960x1x1]
  %middle_blks.0.conv5.bias[FLOAT, 960]
  %middle_blks.0.norm1.weight[FLOAT, 960]
  %middle_blks.0.norm1.bias[FLOAT, 960]
  %middle_blks.0.norm2.weight[FLOAT, 960]
  %middle_blks.0.norm2.bias[FLOAT, 960]
  %middle_blks.1.beta[FLOAT, 1x960x1x1]
  %middle_blks.1.gamma[FLOAT, 1x960x1x1]
  %middle_blks.1.conv1.weight[FLOAT, 1920x960x1x1]
  %middle_blks.1.conv1.bias[FLOAT, 1920]
  %middle_blks.1.conv2.weight[FLOAT, 1920x1x3x3]
  %middle_blks.1.conv2.bias[FLOAT, 1920]
  %middle_blks.1.conv3.weight[FLOAT, 960x960x1x1]
  %middle_blks.1.conv3.bias[FLOAT, 960]
  %middle_blks.1.sca.1.weight[FLOAT, 960x960x1x1]
  %middle_blks.1.sca.1.bias[FLOAT, 960]
  %middle_blks.1.conv4.weight[FLOAT, 1920x960x1x1]
  %middle_blks.1.conv4.bias[FLOAT, 1920]
  %middle_blks.1.conv5.weight[FLOAT, 960x960x1x1]
  %middle_blks.1.conv5.bias[FLOAT, 960]
  %middle_blks.1.norm1.weight[FLOAT, 960]
  %middle_blks.1.norm1.bias[FLOAT, 960]
  %middle_blks.1.norm2.weight[FLOAT, 960]
  %middle_blks.1.norm2.bias[FLOAT, 960]
  %middle_blks.2.beta[FLOAT, 1x960x1x1]
  %middle_blks.2.gamma[FLOAT, 1x960x1x1]
  %middle_blks.2.conv1.weight[FLOAT, 1920x960x1x1]
  %middle_blks.2.conv1.bias[FLOAT, 1920]
  %middle_blks.2.conv2.weight[FLOAT, 1920x1x3x3]
  %middle_blks.2.conv2.bias[FLOAT, 1920]
  %middle_blks.2.conv3.weight[FLOAT, 960x960x1x1]
  %middle_blks.2.conv3.bias[FLOAT, 960]
  %middle_blks.2.sca.1.weight[FLOAT, 960x960x1x1]
  %middle_blks.2.sca.1.bias[FLOAT, 960]
  %middle_blks.2.conv4.weight[FLOAT, 1920x960x1x1]
  %middle_blks.2.conv4.bias[FLOAT, 1920]
  %middle_blks.2.conv5.weight[FLOAT, 960x960x1x1]
  %middle_blks.2.conv5.bias[FLOAT, 960]
  %middle_blks.2.norm1.weight[FLOAT, 960]
  %middle_blks.2.norm1.bias[FLOAT, 960]
  %middle_blks.2.norm2.weight[FLOAT, 960]
  %middle_blks.2.norm2.bias[FLOAT, 960]
  %middle_blks.3.beta[FLOAT, 1x960x1x1]
  %middle_blks.3.gamma[FLOAT, 1x960x1x1]
  %middle_blks.3.conv1.weight[FLOAT, 1920x960x1x1]
  %middle_blks.3.conv1.bias[FLOAT, 1920]
  %middle_blks.3.conv2.weight[FLOAT, 1920x1x3x3]
  %middle_blks.3.conv2.bias[FLOAT, 1920]
  %middle_blks.3.conv3.weight[FLOAT, 960x960x1x1]
  %middle_blks.3.conv3.bias[FLOAT, 960]
  %middle_blks.3.sca.1.weight[FLOAT, 960x960x1x1]
  %middle_blks.3.sca.1.bias[FLOAT, 960]
  %middle_blks.3.conv4.weight[FLOAT, 1920x960x1x1]
  %middle_blks.3.conv4.bias[FLOAT, 1920]
  %middle_blks.3.conv5.weight[FLOAT, 960x960x1x1]
  %middle_blks.3.conv5.bias[FLOAT, 960]
  %middle_blks.3.norm1.weight[FLOAT, 960]
  %middle_blks.3.norm1.bias[FLOAT, 960]
  %middle_blks.3.norm2.weight[FLOAT, 960]
  %middle_blks.3.norm2.bias[FLOAT, 960]
  %middle_blks.4.beta[FLOAT, 1x960x1x1]
  %middle_blks.4.gamma[FLOAT, 1x960x1x1]
  %middle_blks.4.conv1.weight[FLOAT, 1920x960x1x1]
  %middle_blks.4.conv1.bias[FLOAT, 1920]
  %middle_blks.4.conv2.weight[FLOAT, 1920x1x3x3]
  %middle_blks.4.conv2.bias[FLOAT, 1920]
  %middle_blks.4.conv3.weight[FLOAT, 960x960x1x1]
  %middle_blks.4.conv3.bias[FLOAT, 960]
  %middle_blks.4.sca.1.weight[FLOAT, 960x960x1x1]
  %middle_blks.4.sca.1.bias[FLOAT, 960]
  %middle_blks.4.conv4.weight[FLOAT, 1920x960x1x1]
  %middle_blks.4.conv4.bias[FLOAT, 1920]
  %middle_blks.4.conv5.weight[FLOAT, 960x960x1x1]
  %middle_blks.4.conv5.bias[FLOAT, 960]
  %middle_blks.4.norm1.weight[FLOAT, 960]
  %middle_blks.4.norm1.bias[FLOAT, 960]
  %middle_blks.4.norm2.weight[FLOAT, 960]
  %middle_blks.4.norm2.bias[FLOAT, 960]
  %middle_blks.5.beta[FLOAT, 1x960x1x1]
  %middle_blks.5.gamma[FLOAT, 1x960x1x1]
  %middle_blks.5.conv1.weight[FLOAT, 1920x960x1x1]
  %middle_blks.5.conv1.bias[FLOAT, 1920]
  %middle_blks.5.conv2.weight[FLOAT, 1920x1x3x3]
  %middle_blks.5.conv2.bias[FLOAT, 1920]
  %middle_blks.5.conv3.weight[FLOAT, 960x960x1x1]
  %middle_blks.5.conv3.bias[FLOAT, 960]
  %middle_blks.5.sca.1.weight[FLOAT, 960x960x1x1]
  %middle_blks.5.sca.1.bias[FLOAT, 960]
  %middle_blks.5.conv4.weight[FLOAT, 1920x960x1x1]
  %middle_blks.5.conv4.bias[FLOAT, 1920]
  %middle_blks.5.conv5.weight[FLOAT, 960x960x1x1]
  %middle_blks.5.conv5.bias[FLOAT, 960]
  %middle_blks.5.norm1.weight[FLOAT, 960]
  %middle_blks.5.norm1.bias[FLOAT, 960]
  %middle_blks.5.norm2.weight[FLOAT, 960]
  %middle_blks.5.norm2.bias[FLOAT, 960]
  %middle_blks.6.beta[FLOAT, 1x960x1x1]
  %middle_blks.6.gamma[FLOAT, 1x960x1x1]
  %middle_blks.6.conv1.weight[FLOAT, 1920x960x1x1]
  %middle_blks.6.conv1.bias[FLOAT, 1920]
  %middle_blks.6.conv2.weight[FLOAT, 1920x1x3x3]
  %middle_blks.6.conv2.bias[FLOAT, 1920]
  %middle_blks.6.conv3.weight[FLOAT, 960x960x1x1]
  %middle_blks.6.conv3.bias[FLOAT, 960]
  %middle_blks.6.sca.1.weight[FLOAT, 960x960x1x1]
  %middle_blks.6.sca.1.bias[FLOAT, 960]
  %middle_blks.6.conv4.weight[FLOAT, 1920x960x1x1]
  %middle_blks.6.conv4.bias[FLOAT, 1920]
  %middle_blks.6.conv5.weight[FLOAT, 960x960x1x1]
  %middle_blks.6.conv5.bias[FLOAT, 960]
  %middle_blks.6.norm1.weight[FLOAT, 960]
  %middle_blks.6.norm1.bias[FLOAT, 960]
  %middle_blks.6.norm2.weight[FLOAT, 960]
  %middle_blks.6.norm2.bias[FLOAT, 960]
  %middle_blks.7.beta[FLOAT, 1x960x1x1]
  %middle_blks.7.gamma[FLOAT, 1x960x1x1]
  %middle_blks.7.conv1.weight[FLOAT, 1920x960x1x1]
  %middle_blks.7.conv1.bias[FLOAT, 1920]
  %middle_blks.7.conv2.weight[FLOAT, 1920x1x3x3]
  %middle_blks.7.conv2.bias[FLOAT, 1920]
  %middle_blks.7.conv3.weight[FLOAT, 960x960x1x1]
  %middle_blks.7.conv3.bias[FLOAT, 960]
  %middle_blks.7.sca.1.weight[FLOAT, 960x960x1x1]
  %middle_blks.7.sca.1.bias[FLOAT, 960]
  %middle_blks.7.conv4.weight[FLOAT, 1920x960x1x1]
  %middle_blks.7.conv4.bias[FLOAT, 1920]
  %middle_blks.7.conv5.weight[FLOAT, 960x960x1x1]
  %middle_blks.7.conv5.bias[FLOAT, 960]
  %middle_blks.7.norm1.weight[FLOAT, 960]
  %middle_blks.7.norm1.bias[FLOAT, 960]
  %middle_blks.7.norm2.weight[FLOAT, 960]
  %middle_blks.7.norm2.bias[FLOAT, 960]
  %middle_blks.8.beta[FLOAT, 1x960x1x1]
  %middle_blks.8.gamma[FLOAT, 1x960x1x1]
  %middle_blks.8.conv1.weight[FLOAT, 1920x960x1x1]
  %middle_blks.8.conv1.bias[FLOAT, 1920]
  %middle_blks.8.conv2.weight[FLOAT, 1920x1x3x3]
  %middle_blks.8.conv2.bias[FLOAT, 1920]
  %middle_blks.8.conv3.weight[FLOAT, 960x960x1x1]
  %middle_blks.8.conv3.bias[FLOAT, 960]
  %middle_blks.8.sca.1.weight[FLOAT, 960x960x1x1]
  %middle_blks.8.sca.1.bias[FLOAT, 960]
  %middle_blks.8.conv4.weight[FLOAT, 1920x960x1x1]
  %middle_blks.8.conv4.bias[FLOAT, 1920]
  %middle_blks.8.conv5.weight[FLOAT, 960x960x1x1]
  %middle_blks.8.conv5.bias[FLOAT, 960]
  %middle_blks.8.norm1.weight[FLOAT, 960]
  %middle_blks.8.norm1.bias[FLOAT, 960]
  %middle_blks.8.norm2.weight[FLOAT, 960]
  %middle_blks.8.norm2.bias[FLOAT, 960]
  %middle_blks.9.beta[FLOAT, 1x960x1x1]
  %middle_blks.9.gamma[FLOAT, 1x960x1x1]
  %middle_blks.9.conv1.weight[FLOAT, 1920x960x1x1]
  %middle_blks.9.conv1.bias[FLOAT, 1920]
  %middle_blks.9.conv2.weight[FLOAT, 1920x1x3x3]
  %middle_blks.9.conv2.bias[FLOAT, 1920]
  %middle_blks.9.conv3.weight[FLOAT, 960x960x1x1]
  %middle_blks.9.conv3.bias[FLOAT, 960]
  %middle_blks.9.sca.1.weight[FLOAT, 960x960x1x1]
  %middle_blks.9.sca.1.bias[FLOAT, 960]
  %middle_blks.9.conv4.weight[FLOAT, 1920x960x1x1]
  %middle_blks.9.conv4.bias[FLOAT, 1920]
  %middle_blks.9.conv5.weight[FLOAT, 960x960x1x1]
  %middle_blks.9.conv5.bias[FLOAT, 960]
  %middle_blks.9.norm1.weight[FLOAT, 960]
  %middle_blks.9.norm1.bias[FLOAT, 960]
  %middle_blks.9.norm2.weight[FLOAT, 960]
  %middle_blks.9.norm2.bias[FLOAT, 960]
  %ups.0.0.weight[FLOAT, 1920x960x1x1]
  %ups.1.0.weight[FLOAT, 960x480x1x1]
  %ups.2.0.weight[FLOAT, 480x240x1x1]
  %ups.3.0.weight[FLOAT, 240x120x1x1]
  %downs.0.weight[FLOAT, 120x60x2x2]
  %downs.0.bias[FLOAT, 120]
  %downs.1.weight[FLOAT, 240x120x2x2]
  %downs.1.bias[FLOAT, 240]
  %downs.2.weight[FLOAT, 480x240x2x2]
  %downs.2.bias[FLOAT, 480]
  %downs.3.weight[FLOAT, 960x480x2x2]
  %downs.3.bias[FLOAT, 960]
) {
  %/Transpose_output_0 = Transpose[perm = [0, 3, 1, 2]](%gen_input_image)
  %/Shape_output_0 = Shape(%/Transpose_output_0)
  %/Constant_output_0 = Constant[value = <Scalar Tensor []>]()
  %/Gather_output_0 = Gather[axis = 0](%/Shape_output_0, %/Constant_output_0)
  %/Shape_1_output_0 = Shape(%/Transpose_output_0)
  %/Constant_1_output_0 = Constant[value = <Scalar Tensor []>]()
  %/Gather_1_output_0 = Gather[axis = 0](%/Shape_1_output_0, %/Constant_1_output_0)
  %/Constant_2_output_0 = Constant[value = <Scalar Tensor []>]()
  %/Mod_output_0 = Mod[fmod = 0](%/Gather_output_0, %/Constant_2_output_0)
  %/Constant_3_output_0 = Constant[value = <Scalar Tensor []>]()
  %/Sub_output_0 = Sub(%/Constant_3_output_0, %/Mod_output_0)
  %/Constant_4_output_0 = Constant[value = <Scalar Tensor []>]()
  %/Mod_1_output_0 = Mod[fmod = 0](%/Sub_output_0, %/Constant_4_output_0)
  %/Constant_5_output_0 = Constant[value = <Scalar Tensor []>]()
  %/Mod_2_output_0 = Mod[fmod = 0](%/Gather_1_output_0, %/Constant_5_output_0)
  %/Constant_6_output_0 = Constant[value = <Scalar Tensor []>]()
  %/Sub_1_output_0 = Sub(%/Constant_6_output_0, %/Mod_2_output_0)
  %/Constant_7_output_0 = Constant[value = <Scalar Tensor []>]()
  %/Mod_3_output_0 = Mod[fmod = 0](%/Sub_1_output_0, %/Constant_7_output_0)
  %/Constant_8_output_0 = Constant[value = <Tensor>]()
  %onnx::Unsqueeze_682 = Constant[value = <Tensor>]()
  %/Unsqueeze_output_0 = Unsqueeze(%/Mod_3_output_0, %onnx::Unsqueeze_682)
  %/Constant_9_output_0 = Constant[value = <Tensor>]()
  %onnx::Unsqueeze_686 = Constant[value = <Tensor>]()
  %/Unsqueeze_1_output_0 = Unsqueeze(%/Mod_1_output_0, %onnx::Unsqueeze_686)
  %/Concat_output_0 = Concat[axis = 0](%/Constant_8_output_0, %/Unsqueeze_output_0, %/Constant_9_output_0, %/Unsqueeze_1_output_0)
  %/Constant_10_output_0 = Constant[value = <Tensor>]()
  %onnx::Unsqueeze_691 = Constant[value = <Tensor>]()
  %/Unsqueeze_2_output_0 = Unsqueeze(%/Mod_3_output_0, %onnx::Unsqueeze_691)
  %/Constant_11_output_0 = Constant[value = <Tensor>]()
  %onnx::Unsqueeze_695 = Constant[value = <Tensor>]()
  %/Unsqueeze_3_output_0 = Unsqueeze(%/Mod_1_output_0, %onnx::Unsqueeze_695)
  %/Concat_1_output_0 = Concat[axis = 0](%/Constant_10_output_0, %/Unsqueeze_2_output_0, %/Constant_11_output_0, %/Unsqueeze_3_output_0)
  %/Constant_12_output_0 = Constant[value = <Tensor>]()
  %/Shape_2_output_0 = Shape(%/Concat_output_0)
  %/Gather_2_output_0 = Gather[axis = 0](%/Shape_2_output_0, %/Constant_12_output_0)
  %/Constant_13_output_0 = Constant[value = <Scalar Tensor []>]()
  %/Sub_2_output_0 = Sub(%/Constant_13_output_0, %/Gather_2_output_0)
  %/Cast_output_0 = Cast[to = 7](%/Concat_1_output_0)
  %/ConstantOfShape_output_0 = ConstantOfShape[value = <Tensor>](%/Sub_2_output_0)
  %/Concat_2_output_0 = Concat[axis = 0](%/Cast_output_0, %/ConstantOfShape_output_0)
  %/Constant_14_output_0 = Constant[value = <Tensor>]()
  %/Reshape_output_0 = Reshape[allowzero = 0](%/Concat_2_output_0, %/Constant_14_output_0)
  %/Constant_15_output_0 = Constant[value = <Tensor>]()
  %/Constant_16_output_0 = Constant[value = <Tensor>]()
  %/Constant_17_output_0 = Constant[value = <Tensor>]()
  %/Constant_18_output_0 = Constant[value = <Tensor>]()
  %/Slice_output_0 = Slice(%/Reshape_output_0, %/Constant_16_output_0, %/Constant_17_output_0, %/Constant_15_output_0, %/Constant_18_output_0)
  %/Transpose_1_output_0 = Transpose[perm = [1, 0]](%/Slice_output_0)
  %/Constant_19_output_0 = Constant[value = <Tensor>]()
  %/Reshape_1_output_0 = Reshape[allowzero = 0](%/Transpose_1_output_0, %/Constant_19_output_0)
  %/Cast_1_output_0 = Cast[to = 7](%/Reshape_1_output_0)
  %/Pad_output_0 = Pad[mode = 'constant'](%/Transpose_output_0, %/Cast_1_output_0, %)
  %/intro/Conv_output_0 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%/Pad_output_0, %intro.weight, %intro.bias)
  %/encoders.0/encoders.0.0/Shape_output_0 = Shape(%/intro/Conv_output_0)
  %/encoders.0/encoders.0.0/Constant_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/Gather_output_0 = Gather[axis = 0](%/encoders.0/encoders.0.0/Shape_output_0, %/encoders.0/encoders.0.0/Constant_output_0)
  %/encoders.0/encoders.0.0/Shape_1_output_0 = Shape(%/intro/Conv_output_0)
  %/encoders.0/encoders.0.0/Constant_1_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/Gather_1_output_0 = Gather[axis = 0](%/encoders.0/encoders.0.0/Shape_1_output_0, %/encoders.0/encoders.0.0/Constant_1_output_0)
  %/encoders.0/encoders.0.0/norm1/Shape_output_0 = Shape(%/intro/Conv_output_0)
  %/encoders.0/encoders.0.0/norm1/Constant_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/norm1/Gather_output_0 = Gather[axis = 0](%/encoders.0/encoders.0.0/norm1/Shape_output_0, %/encoders.0/encoders.0.0/norm1/Constant_output_0)
  %/encoders.0/encoders.0.0/norm1/ReduceMean_output_0 = ReduceMean[axes = [1], keepdims = 1](%/intro/Conv_output_0)
  %/encoders.0/encoders.0.0/norm1/Sub_output_0 = Sub(%/intro/Conv_output_0, %/encoders.0/encoders.0.0/norm1/ReduceMean_output_0)
  %/encoders.0/encoders.0.0/norm1/Constant_1_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/norm1/Pow_output_0 = Pow(%/encoders.0/encoders.0.0/norm1/Sub_output_0, %/encoders.0/encoders.0.0/norm1/Constant_1_output_0)
  %/encoders.0/encoders.0.0/norm1/ReduceMean_1_output_0 = ReduceMean[axes = [1], keepdims = 1](%/encoders.0/encoders.0.0/norm1/Pow_output_0)
  %/encoders.0/encoders.0.0/norm1/Sub_1_output_0 = Sub(%/intro/Conv_output_0, %/encoders.0/encoders.0.0/norm1/ReduceMean_output_0)
  %/encoders.0/encoders.0.0/norm1/Constant_2_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/norm1/Add_output_0 = Add(%/encoders.0/encoders.0.0/norm1/ReduceMean_1_output_0, %/encoders.0/encoders.0.0/norm1/Constant_2_output_0)
  %/encoders.0/encoders.0.0/norm1/Sqrt_output_0 = Sqrt(%/encoders.0/encoders.0.0/norm1/Add_output_0)
  %/encoders.0/encoders.0.0/norm1/Div_output_0 = Div(%/encoders.0/encoders.0.0/norm1/Sub_1_output_0, %/encoders.0/encoders.0.0/norm1/Sqrt_output_0)
  %/encoders.0/encoders.0.0/norm1/Constant_3_output_0 = Constant[value = <Tensor>]()
  %onnx::Unsqueeze_746 = Constant[value = <Tensor>]()
  %/encoders.0/encoders.0.0/norm1/Unsqueeze_output_0 = Unsqueeze(%/encoders.0/encoders.0.0/norm1/Gather_output_0, %onnx::Unsqueeze_746)
  %/encoders.0/encoders.0.0/norm1/Constant_4_output_0 = Constant[value = <Tensor>]()
  %/encoders.0/encoders.0.0/norm1/Constant_5_output_0 = Constant[value = <Tensor>]()
  %/encoders.0/encoders.0.0/norm1/Concat_output_0 = Concat[axis = 0](%/encoders.0/encoders.0.0/norm1/Constant_3_output_0, %/encoders.0/encoders.0.0/norm1/Unsqueeze_output_0, %/encoders.0/encoders.0.0/norm1/Constant_4_output_0, %/encoders.0/encoders.0.0/norm1/Constant_5_output_0)
  %/encoders.0/encoders.0.0/norm1/Reshape_output_0 = Reshape[allowzero = 0](%encoders.0.0.norm1.weight, %/encoders.0/encoders.0.0/norm1/Concat_output_0)
  %/encoders.0/encoders.0.0/norm1/Mul_output_0 = Mul(%/encoders.0/encoders.0.0/norm1/Reshape_output_0, %/encoders.0/encoders.0.0/norm1/Div_output_0)
  %/encoders.0/encoders.0.0/norm1/Constant_6_output_0 = Constant[value = <Tensor>]()
  %onnx::Unsqueeze_760 = Constant[value = <Tensor>]()
  %/encoders.0/encoders.0.0/norm1/Unsqueeze_1_output_0 = Unsqueeze(%/encoders.0/encoders.0.0/norm1/Gather_output_0, %onnx::Unsqueeze_760)
  %/encoders.0/encoders.0.0/norm1/Constant_7_output_0 = Constant[value = <Tensor>]()
  %/encoders.0/encoders.0.0/norm1/Constant_8_output_0 = Constant[value = <Tensor>]()
  %/encoders.0/encoders.0.0/norm1/Concat_1_output_0 = Concat[axis = 0](%/encoders.0/encoders.0.0/norm1/Constant_6_output_0, %/encoders.0/encoders.0.0/norm1/Unsqueeze_1_output_0, %/encoders.0/encoders.0.0/norm1/Constant_7_output_0, %/encoders.0/encoders.0.0/norm1/Constant_8_output_0)
  %/encoders.0/encoders.0.0/norm1/Reshape_1_output_0 = Reshape[allowzero = 0](%encoders.0.0.norm1.bias, %/encoders.0/encoders.0.0/norm1/Concat_1_output_0)
  %/encoders.0/encoders.0.0/norm1/Add_1_output_0 = Add(%/encoders.0/encoders.0.0/norm1/Mul_output_0, %/encoders.0/encoders.0.0/norm1/Reshape_1_output_0)
  %/encoders.0/encoders.0.0/conv1/Conv_output_0 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%/encoders.0/encoders.0.0/norm1/Add_1_output_0, %encoders.0.0.conv1.weight, %encoders.0.0.conv1.bias)
  %/encoders.0/encoders.0.0/conv2/Conv_output_0 = Conv[dilations = [1, 1], group = 120, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%/encoders.0/encoders.0.0/conv1/Conv_output_0, %encoders.0.0.conv2.weight, %encoders.0.0.conv2.bias)
  %/encoders.0/encoders.0.0/Mul_output_0 = Mul(%/encoders.0/encoders.0.0/conv2/Conv_output_0, %/encoders.0/encoders.0.0/conv2/Conv_output_0)
  %/encoders.0/encoders.0.0/Mul_1_output_0 = Mul(%/encoders.0/encoders.0.0/conv2/Conv_output_0, %/encoders.0/encoders.0.0/Mul_output_0)
  %/encoders.0/encoders.0.0/Constant_2_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/Mul_2_output_0 = Mul(%/encoders.0/encoders.0.0/Constant_2_output_0, %/encoders.0/encoders.0.0/Mul_1_output_0)
  %/encoders.0/encoders.0.0/Add_output_0 = Add(%/encoders.0/encoders.0.0/conv2/Conv_output_0, %/encoders.0/encoders.0.0/Mul_2_output_0)
  %/encoders.0/encoders.0.0/Constant_3_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/Mul_3_output_0 = Mul(%/encoders.0/encoders.0.0/Constant_3_output_0, %/encoders.0/encoders.0.0/Add_output_0)
  %/encoders.0/encoders.0.0/Tanh_output_0 = Tanh(%/encoders.0/encoders.0.0/Mul_3_output_0)
  %/encoders.0/encoders.0.0/Constant_4_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/Add_1_output_0 = Add(%/encoders.0/encoders.0.0/Constant_4_output_0, %/encoders.0/encoders.0.0/Tanh_output_0)
  %/encoders.0/encoders.0.0/Mul_4_output_0 = Mul(%/encoders.0/encoders.0.0/conv2/Conv_output_0, %/encoders.0/encoders.0.0/Add_1_output_0)
  %/encoders.0/encoders.0.0/Constant_5_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/Mul_5_output_0 = Mul(%/encoders.0/encoders.0.0/Constant_5_output_0, %/encoders.0/encoders.0.0/Mul_4_output_0)
  %/encoders.0/encoders.0.0/Shape_2_output_0 = Shape(%/encoders.0/encoders.0.0/Mul_5_output_0)
  %/encoders.0/encoders.0.0/Constant_6_output_0 = Constant[value = <Tensor>]()
  %/encoders.0/encoders.0.0/Gather_2_output_0 = Gather[axis = 0](%/encoders.0/encoders.0.0/Shape_2_output_0, %/encoders.0/encoders.0.0/Constant_6_output_0)
  %/encoders.0/encoders.0.0/Constant_7_output_0 = Constant[value = <Tensor>]()
  %/encoders.0/encoders.0.0/Constant_8_output_0 = Constant[value = <Tensor>]()
  %/encoders.0/encoders.0.0/Add_2_output_0 = Add(%/encoders.0/encoders.0.0/Gather_2_output_0, %/encoders.0/encoders.0.0/Constant_8_output_0)
  %/encoders.0/encoders.0.0/Constant_9_output_0 = Constant[value = <Tensor>]()
  %/encoders.0/encoders.0.0/Div_output_0 = Div(%/encoders.0/encoders.0.0/Add_2_output_0, %/encoders.0/encoders.0.0/Constant_9_output_0)
  %/encoders.0/encoders.0.0/Constant_10_output_0 = Constant[value = <Tensor>]()
  %/encoders.0/encoders.0.0/Mul_6_output_0 = Mul(%/encoders.0/encoders.0.0/Div_output_0, %/encoders.0/encoders.0.0/Constant_10_output_0)
  %/encoders.0/encoders.0.0/Slice_output_0 = Slice(%/encoders.0/encoders.0.0/Mul_5_output_0, %/encoders.0/encoders.0.0/Constant_7_output_0, %/encoders.0/encoders.0.0/Mul_6_output_0, %/encoders.0/encoders.0.0/Constant_6_output_0)
  %/encoders.0/encoders.0.0/Constant_11_output_0 = Constant[value = <Tensor>]()
  %/encoders.0/encoders.0.0/Mul_7_output_0 = Mul(%/encoders.0/encoders.0.0/Div_output_0, %/encoders.0/encoders.0.0/Constant_11_output_0)
  %/encoders.0/encoders.0.0/Slice_1_output_0 = Slice(%/encoders.0/encoders.0.0/Mul_5_output_0, %/encoders.0/encoders.0.0/Mul_6_output_0, %/encoders.0/encoders.0.0/Mul_7_output_0, %/encoders.0/encoders.0.0/Constant_6_output_0)
  %/encoders.0/encoders.0.0/Add_3_output_0 = Add(%/encoders.0/encoders.0.0/Slice_output_0, %/encoders.0/encoders.0.0/Slice_1_output_0)
  %/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.0/depthwise/Conv_output_0 = Conv[dilations = [1, 1], group = 60, kernel_shape = [3, 3], pads = [0, 0, 0, 0], strides = [2, 2]](%/encoders.0/encoders.0.0/Add_3_output_0, %encoders.0.0.GCE.depthwise_separable_convs.0.depthwise.weight)
  %/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.0/pointwise/Conv_output_0 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.0/depthwise/Conv_output_0, %encoders.0.0.GCE.depthwise_separable_convs.0.pointwise.weight)
  %/encoders.0/encoders.0.0/GCE/Mul_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.0/pointwise/Conv_output_0, %/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.0/pointwise/Conv_output_0)
  %/encoders.0/encoders.0.0/GCE/Mul_1_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.0/pointwise/Conv_output_0, %/encoders.0/encoders.0.0/GCE/Mul_output_0)
  %/encoders.0/encoders.0.0/GCE/Constant_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/GCE/Mul_2_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/Constant_output_0, %/encoders.0/encoders.0.0/GCE/Mul_1_output_0)
  %/encoders.0/encoders.0.0/GCE/Add_output_0 = Add(%/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.0/pointwise/Conv_output_0, %/encoders.0/encoders.0.0/GCE/Mul_2_output_0)
  %/encoders.0/encoders.0.0/GCE/Constant_1_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/GCE/Mul_3_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/Constant_1_output_0, %/encoders.0/encoders.0.0/GCE/Add_output_0)
  %/encoders.0/encoders.0.0/GCE/Tanh_output_0 = Tanh(%/encoders.0/encoders.0.0/GCE/Mul_3_output_0)
  %/encoders.0/encoders.0.0/GCE/Constant_2_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/GCE/Add_1_output_0 = Add(%/encoders.0/encoders.0.0/GCE/Constant_2_output_0, %/encoders.0/encoders.0.0/GCE/Tanh_output_0)
  %/encoders.0/encoders.0.0/GCE/Mul_4_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.0/pointwise/Conv_output_0, %/encoders.0/encoders.0.0/GCE/Add_1_output_0)
  %/encoders.0/encoders.0.0/GCE/Constant_3_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/GCE/Mul_5_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/Constant_3_output_0, %/encoders.0/encoders.0.0/GCE/Mul_4_output_0)
  %/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.1/depthwise/Conv_output_0 = Conv[dilations = [1, 1], group = 60, kernel_shape = [3, 3], pads = [0, 0, 0, 0], strides = [3, 3]](%/encoders.0/encoders.0.0/GCE/Mul_5_output_0, %encoders.0.0.GCE.depthwise_separable_convs.1.depthwise.weight)
  %/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.1/pointwise/Conv_output_0 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.1/depthwise/Conv_output_0, %encoders.0.0.GCE.depthwise_separable_convs.1.pointwise.weight)
  %/encoders.0/encoders.0.0/GCE/Mul_6_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.1/pointwise/Conv_output_0, %/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.1/pointwise/Conv_output_0)
  %/encoders.0/encoders.0.0/GCE/Mul_7_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.1/pointwise/Conv_output_0, %/encoders.0/encoders.0.0/GCE/Mul_6_output_0)
  %/encoders.0/encoders.0.0/GCE/Constant_4_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/GCE/Mul_8_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/Constant_4_output_0, %/encoders.0/encoders.0.0/GCE/Mul_7_output_0)
  %/encoders.0/encoders.0.0/GCE/Add_2_output_0 = Add(%/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.1/pointwise/Conv_output_0, %/encoders.0/encoders.0.0/GCE/Mul_8_output_0)
  %/encoders.0/encoders.0.0/GCE/Constant_5_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/GCE/Mul_9_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/Constant_5_output_0, %/encoders.0/encoders.0.0/GCE/Add_2_output_0)
  %/encoders.0/encoders.0.0/GCE/Tanh_1_output_0 = Tanh(%/encoders.0/encoders.0.0/GCE/Mul_9_output_0)
  %/encoders.0/encoders.0.0/GCE/Constant_6_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/GCE/Add_3_output_0 = Add(%/encoders.0/encoders.0.0/GCE/Constant_6_output_0, %/encoders.0/encoders.0.0/GCE/Tanh_1_output_0)
  %/encoders.0/encoders.0.0/GCE/Mul_10_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.1/pointwise/Conv_output_0, %/encoders.0/encoders.0.0/GCE/Add_3_output_0)
  %/encoders.0/encoders.0.0/GCE/Constant_7_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/GCE/Mul_11_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/Constant_7_output_0, %/encoders.0/encoders.0.0/GCE/Mul_10_output_0)
  %/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.2/depthwise/Conv_output_0 = Conv[dilations = [1, 1], group = 60, kernel_shape = [5, 5], pads = [0, 0, 0, 0], strides = [4, 4]](%/encoders.0/encoders.0.0/GCE/Mul_11_output_0, %encoders.0.0.GCE.depthwise_separable_convs.2.depthwise.weight)
  %/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.2/pointwise/Conv_output_0 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.2/depthwise/Conv_output_0, %encoders.0.0.GCE.depthwise_separable_convs.2.pointwise.weight)
  %/encoders.0/encoders.0.0/GCE/Mul_12_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.2/pointwise/Conv_output_0, %/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.2/pointwise/Conv_output_0)
  %/encoders.0/encoders.0.0/GCE/Mul_13_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.2/pointwise/Conv_output_0, %/encoders.0/encoders.0.0/GCE/Mul_12_output_0)
  %/encoders.0/encoders.0.0/GCE/Constant_8_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/GCE/Mul_14_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/Constant_8_output_0, %/encoders.0/encoders.0.0/GCE/Mul_13_output_0)
  %/encoders.0/encoders.0.0/GCE/Add_4_output_0 = Add(%/encoders.0/encoders.0.0/GCE/depthwise_separable_convs.2/pointwise/Conv_output_0, %/encoders.0/encoders.0.0/GCE/Mul_14_output_0)
  %/encoders.0/encoders.0.0/GCE/Constant_9_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/GCE/Mul_15_output_0 = Mul(%/encoders.0/encoders.0.0/GCE/Constant_9_output_0, %/encoders.0/encoders.0.0/GCE/Add_4_output_0)
  %/encoders.0/encoders.0.0/GCE/Tanh_2_output_0 = Tanh(%/encoders.0/encoders.0.0/GCE/Mul_15_output_0)
  %/encoders.0/encoders.0.0/GCE/Constant_10_output_0 = Constant[value = <Scalar Tensor []>]()
  %/encoders.0/encoders.0.0/GCE/Add_5_output_0 = Add(%/encoders.0/encoders.0.0/GCE/Constant_10_output_0, %/encoders.0/encoders.0.0/GCE/Tanh_2_output_0)
